app/Http/Controllers/ColdController.php

update `users` set `feel` = '-1', `updated_at` = '2018-07-06 15:42:32' where `id` = '6'
---
    public function update()
    {
        $user = \Auth::user();;
        $user->feel = -1;
        $user->save();