app/Http/Controllers/FeelController.php

    public function store(Request $request)
    {

        $user = \Auth::user();

        $user->feel = $request->feel;

        $user->save();
---
update `users` set `feel` = '1', `updated_at` = '2018-07-06 13:30:10' where `id` = '2'