app/Http/Controllers/HotController.php

    public function update()
    {
        $user = \Auth::user();;
        if ($user->sex==0){
            if ($user->size==0){
                $user->feel = 1;
                $user->save();
---
update `users` set `feel` = '1', `updated_at` = '2018-07-09 10:58:16' where `id` = '9'